{"data":{"post":{"id":"50b3e94f-c379-5c31-8641-9ba34f1dfc4e","html":"<p>聊聊最近发生的事儿，包含私事和公司的事儿，本周上了五天班，请了两天半的假，这一周大半的时间就这样匆匆过去，因为有国庆假期在前，十月份上班第一周便已到月中。</p>\n<p><img src=\"https://imgs.wdcorner.cn/MaZTgLKrNFpFdA9IlEcge.png\" alt=\"recent_jpg\"></p>\n<h2>代码方面</h2>\n<p>公司目前做新需求的项目开发，在以往基础上做调整，同时对线上的代码做维护工作。</p>\n<p>个人项目就目前用到的这个博客主题，用gatsby构建，一个基于react的静态博客构建框架。目前仍有一些问题有待解决，诸如每次打包会生成新版本的文件(js/css等)，推代码的时候之后旧版本的js和新版本js都存在服务器中，生成不少无用文件。另一个便是缓存的问题，每次输入域名打开网址的时候都会有比较严重的缓存问题，只能手动清除缓存才能看到更新，自我感觉和第一个问题有关。</p>\n<h2>练车方面</h2>\n<p>再聊聊剩余两天半干的事儿，去考科二去了，但是很遗憾，没过…</p>\n<p>总希望能听到一帆风顺的事儿，但失败也是其中的一部分，也必须要去面对，需要去总结失败的原因</p>\n<p>相比于考前两天每晚失眠，反而考完试之后倒是轻松了许多（在考试前确实非常紧张，即便告诫自己没必要，但还是不由自主紧张）</p>\n<p>自我感觉这次我们准备的已经很充分了，考前两天便到了考点周边，模拟考试、反复练习、去正式考点找点位，感觉我们每个练习的小伙伴练习的都非常好，都应该是可以过的。但结果总是事与愿违，运气也着实背了点，我们中大部分人在第一项坡道定点起步就挂了，两次均是如此</p>\n<p>我也一样，两次考试都挂在了上坡停车那一步，没有停到规定的位置上，系统提示信息录入，考试不合格。好吧，以往听到别人考车挂科，第一反应总是以为他没练好，但自己真实经历过之后才知道，确实不是这样的。考前即便练的再好也有可能挂科，这事我感觉“技能+心态+运气”，三者还必须要都有，缺一不可。</p>\n<p>再聊聊科二考试要考的那些点，现在脑子里边还都是相应的考试项，趁着脑子还有记忆，把它记录下来，下次补考也能看看。</p>\n<h3>出发准备</h3>\n<p>上车—开始考试，系安全带，调整座椅、调整左右后视镜，挂档位、松手刹、打左转向灯，出发</p>\n<p>车向前行驶至门把手与坡道栏杆对齐处，向右打一圈半，45度回半圈，车身对齐回一圈</p>\n<h3>坡道定点停车和起步</h3>\n<p>车向坡道行驶，方向盘12点方向与“停”字单人旁对齐，继续向前行驶至肩膀与左侧标记点处对齐停车（这次挂科两次都在这个地方，自我感觉已经按照标记点停车了，但还是没到位）、踩刹车、拉手刹。30s之内启动，松手刹，打左转向灯，松离合至联动点处，慢慢放刹车，车继续前进。</p>\n<p>车在下坡处可适当向右行驶，到坡底停车缓冲（关掉转向灯）</p>\n<h3>直角转弯</h3>\n<p>车缓慢前进（一定要慢），车头左侧（左侧车轮毂处）与前方直角标记处对齐-打右转向灯，门把手与直角转弯右侧线对齐-向右打一圈半，45度回半圈，车头快挨取卡处回一圈，然后向右打1/4圈</p>\n<h3>模拟高速停车取卡（内车道该项在曲线行驶之后）</h3>\n<p>肩膀与取卡柱对齐—停车、挂空档、拉手刹，按红色按钮（若够不着可把安全带最大范围拉长，身体往外）</p>\n<p>挂一档、松手刹，车继续向前行驶，车身与前方黄线对齐—向右打一圈方向，左侧即将与S线左侧平行，回一圈</p>\n<h3>曲线行驶</h3>\n<p>车向前行驶至车头看不到前方标记线处，向左打一圈又1/4方向；观察左后视镜，感觉车身离左侧线比较近可中途回掉1/4方向，右车头处与内圈线视线相挨回一圈；右车头与外圈线视线相挨向右打一圈又1/4方向；中途依照情况回一圈又1/4（跑道2此处需先回1/4，看到水井盖打满半圈，左车头即将与停车取卡对齐处回一圈半，然后向右打1/4）</p>\n<p>车行驶至侧方停车标记位置处停车（方向盘12点与前方标记黑点处对齐、左后视镜过地面分割线处）</p>\n<h3>侧方停车</h3>\n<p>入库：挂倒档，当右后视镜即将看不到入库线时向右打一圈半—观察左后视镜，左车车身即将与库角外侧标记点对齐时—回一圈半，后轮即将过线时向左打一圈半，右测车身与内线平行停车</p>\n<p>出库：挂前进档、打左转向灯，左侧车头与外线视线相挨回一圈半，车头中线与外线视线相挨向右打一圈，车身变正回一圈</p>\n<p>向前行驶至倒车入库标记处停车（方向盘12点与前方标记黑点(左数第二条黄色标记线中部位置)对齐，左后视镜过黄线）</p>\n<h3>倒车入库（右倒库/左倒库）</h3>\n<p>右倒库：挂倒档，肩膀处与外侧标记白点（树根下标记的白点）处对齐向右打一圈半，观察左后视镜，即将看到库角—回半圈，车身与库线平行回一圈，肩膀处与左侧标记处对齐停车、踩刹车</p>\n<p>左出库：挂前进档、打左转向灯，松离合器至联动点处放刹车，车窗后部即将过出库线向左打一圈又1/4，左后视镜过前方标记线停车</p>\n<p>左倒库：挂倒档向后行驶，观察左侧后视镜—左侧车身即将与左库角重合打满半圈，观察右侧后视镜—右侧车身即将与右库角重合回半圈，车身平行回一圈，肩膀处与左侧标记点对齐踩刹车停车。</p>\n<p>右出库：挂前进档、打右转向灯，松离合器至联动点处放刹车，车头与前方线对齐向右打一圈半出库</p>\n<p>语音播报：“考试结束，成绩合格，请到大厅打印成绩单。”</p>\n<h3>四左俩右</h3>\n<p>四个左转向灯（开始起步、坡道起步、侧方出库、左出库），两个右转向灯（直角转弯、右出库），两次拉手刹（坡道停车、停车取卡）</p>\n<h2>结尾</h2>\n<p>虽然没过，但心里也没那么悲，在驾车考试这一方面，必须要慎重一些，国家考试严格是应该的，毕竟现在交通事故那么多，如果只靠运气就拿到驾驶证，日后反而是一种潜在的隐患。</p>\n<p>不灰心不放弃，继续努力。</p>","fields":{"slug":"/最近的总结/","prefix":"2019-10-13"},"frontmatter":{"title":"近来的一些总结","author":"大锅","category":"杂谈","cover":{"childImageSharp":{"resize":{"src":"/static/fe599175e0f561dd38067e939deb0aa8/eadbd/cover_img16.jpg"}}}}},"authornote":{"id":"b13ff4ad-8ca7-582d-aa8a-fd0363f52182","html":"<p>版权声明：自由转载-非商用-非衍生-保持署名（创意共享3.0许可证）</p>\n<p>打开微信搜索小程序“奉壹杂记”，不一样移动端体验</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/最近的总结/","prev":{"id":"b639848d-a1fc-5ac2-bb45-11f719e33ba4","fields":{"slug":"/程序员的自我修养/","prefix":"2019-10-08","source":"posts"},"frontmatter":{"title":"程序员的自我修养","category":"书籍"}},"source":"posts"}}